{
  "backend/entitlements.mo": "Defines entitlement state and functions to check subscription or trial validity based on system time.",
  "backend/main.mo": "Actor managing user profiles, access control, and entitlement lifecycle including trials and subscriptions.",
  "feature_evidence.json": "Feature evidence report describing removal of specific Settings UI elements with associated file and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files including components, hooks, utilities, and templates.",
  "frontend/index.css": "Global Tailwind base styles defining OKLCH color variables for light and dark modes.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx with a default title and favicon.",
  "frontend/src/App.tsx": "Main React app implementing order entry, line items, imports, settings, WhatsApp preview, and guidance sections.",
  "frontend/src/components/EntitlementCallout.tsx": "Empty file placeholder for entitlement access callout component.",
  "frontend/src/components/EntitlementStatus.tsx": "Empty file placeholder for entitlement status display component.",
  "frontend/src/components/HelplineAction.tsx": "Button component that displays a clickable helpline phone link when configured in settings.",
  "frontend/src/components/LoginButton.tsx": "Empty file placeholder for authentication button component.",
  "frontend/src/components/ProfileSetup.tsx": "Empty file placeholder for first-time user profile setup modal.",
  "frontend/src/components/PublishSellGuidance.tsx": "Accordion-based guide explaining how to share or distribute the app via web link or app stores.",
  "frontend/src/components/SettingsCard.tsx": "Settings card allowing users to edit and save the helpline phone number with local state handling.",
  "frontend/src/components/UpgradeSubscriptionCard.tsx": "Empty file placeholder for subscription upgrade UI component.",
  "frontend/src/components/WhatsAppSendPreviewModal.tsx": "Modal showing a read‑only WhatsApp message preview, optional block alert, and confirm/cancel actions.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useAppSettings.ts": "Manages app name and helpline phone settings with localStorage persistence and automatic document title updates.",
  "frontend/src/hooks/useEntitlement.ts": "Fetches entitlement state and exposes trial, subscription, and cancellation actions with derived access flags and messages.",
  "frontend/src/hooks/useImportedLists.ts": "Loads, saves, and clears imported party/item lists using localStorage with simple state management.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading stored identities, handling login/logout, and exposing identity state.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls into React Query hooks for user profiles and entitlement actions with cache invalidation.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables for light/dark themes and global element styling.",
  "frontend/src/lib/entitlement.ts": "Utilities to compute trial timing, expiration, and user‑facing entitlement messages from EntitlementState.",
  "frontend/src/lib/importLists/parseImportedLists.ts": "Provides utilities to parse CSV/XLSX files and extract unique party and item names with error handling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, layout, animations, and typography settings.",
  "project_state.json": "Stores project metadata, versions, and records a feature request to remove specific UI elements."
}